#include <any>
#include <cstdint>
#include <cstdio>
#include <cstdlib>
#include <cstring>
#include <fstream>
#include <functional>
#include <iostream>
#include <tuple>
#include <string>
#include <vector>

/*
 * LOGS:
 *
 * - Load ROMS
 * - Read|Write bytes
 * @ Cpu opcodes -> [current: 8 bit loading]
 * ^ Interrupts, and fix the infinite loop
 * - Accurate Timing
 * - PPU
 * - APU
 */

// Will delete later (when, I finish the PPU)
using namespace std;
using namespace std::placeholders;

// Shorthands
// *********************************
#define u8  uint8_t
#define u16  uint16_t
#define u32 uint32_t
// *********************************

// Flags
// *********************************
#define FLAG_Z    (1 << 7) // Zero flag
#define FLAG_N    (1 << 6) // Subtraction flag
#define FLAG_H    (1 << 5) // Half carry flag
#define FLAG_C    (1 << 4) // Carry flag
// *********************************

// https://gbdev.io/pandocs/The_Cartridge_Header.html
namespace header {
    const int entry_point       = 0x0100; const int logo              = 0x0104;
    const int title             = 0x0134; const int manufacturer_code = 0x013F;
    const int cgb_flag          = 0x0143; const int new_license_code  = 0x0144;
    const int sgb_flag          = 0x0146; const int cartridge_type    = 0x0147;
    const int rom_size          = 0x0148; const int ram_size          = 0x0149;
    const int destination_code  = 0x014A; const int old_license_code  = 0x014B;
    const int version_number    = 0x014C; const int header_checksum   = 0x014D;
    const int global_checksum   = 0x014E;}

// For now, we are only doing no MBC
// This is the cartridge part
// *********************************
const char *fp = "roms/drmario.gb";
u8 version;
// *********************************

namespace Cartridge
{
    // https://gbdev.gg8.se/wiki/articles/Memory_Bank_Controllers
    // we don't need to worry about ROM banking right now
    u8 ROM[0x4000 * 2]; // 0x4000 - 0x7FFF
    u8 IO[0x80]; // FF00 - FF7F
    u8 HRAM[0xFFFF-0xFF80];
    u8 SRAM[0x2000];
    bool loaded = false;

    constexpr size_t TITLE_LENGTH = 11;
    char title[11];

    void LoadRomTitle() {
        for (auto i=0u; i<TITLE_LENGTH; ++i) {
            title[i] = ROM[header::title+i];
        }
    }

    void LoadRom(const char *filename) {
        FILE *f;
        f = fopen(filename, "rb");
        fread(ROM, 0x4000 * 2, 1, f);
        printf("Completed loading ROM: %s\n", filename);
        LoadRomTitle();
        fclose(f);

        loaded = true;
    }
}

namespace CPU
{
    struct Register {
        u16 SP, PC;
        // Registers, ordered Low first, then High
        union {
            u16 AF;
            struct {
                u8 F;
                u8 A;};};
        union {
            u16 BC;
            struct {
                u8 C;
                u8 B;};};
        union {
            u16 DE;
            struct {
                u8 E;
                u8 D;};};
        union {
            u16 HL;
            struct {
                u8 L;
                u8 H;};};
    } registers;

    // http://gameboy.mongenel.com/dmg/asmmemmap.html
    u8 RAM[0x1000]; // Internal RAM

    template<bool write> unsigned MemAccess(u16 addr, u8 value=0);
    unsigned RB(u16 addr) { return MemAccess<false>(addr); }
    unsigned WB(u16 addr, u8 value) { return MemAccess<true>(addr, value); }
    void tick();
}

namespace IO
{
    // https://gbdev.io/pandocs/Joypad_Input.html#ff00--p1joyp-joypad
    struct {
        union {
            u8 keys;
            struct {
                unsigned int P10 : 1; // Right or A
                unsigned int P11 : 1; // Left  or B
                unsigned int P12 : 1; // Up    or Select
                unsigned int P13 : 1; // Down  or Start
                unsigned int P14 : 1; // Direction buttons
                unsigned int P15 : 1; // Action    buttons
            };};
    } joypad;
    u8 joy_current;
}

namespace PPU
{
    u8 VRAM[0x2000];
    u8 OAM[0xA0];

    struct {
        u8 control; // FF40
        u8 status;  // FF41
        u8 SCY;
        u8 SCX;
        u8 LY;      // FF44
        u8 LYC;
        u8 WY;      // Y Position
        u8 WX;      // X Position + 7
    } lcd;
}

namespace CPU
{
    void tick() {
        // Call PPU::tick()
    }

    struct {
        u8 IME;
        // 0xFFFF
        union {
            u8 IE;
            struct {
                unsigned int EVBLANK : 1;
                unsigned int ELCD    : 1;
                unsigned int ETimer  : 1;
                unsigned int ESerial : 1;
                unsigned int EJoypad : 1;
            };};
        // 0xFF0F
        union {
            u8 IF;
            struct {
                unsigned int FVBLANK : 1;
                unsigned int FLCD    : 1;
                unsigned int FTimer  : 1;
                unsigned int FSerial : 1;
                unsigned int FJoypad : 1;
            };};
    } interrupts;

    struct {
        u8 DIV;     // FF04
        u8 TIMA;    // FF05
        u8 TMA;     // FF06
        union {
            u8 TAC; // FF07
            struct {
                unsigned int Speed  : 2;
                unsigned int Enable : 1;
            };};
    } timer;

    unsigned ft(unsigned n) {
        unsigned r=0;
        for (int i=0; i<8*n; i+=8)
            r = (RB(registers.PC++)<<i) | r;
        return r;
    }

    void set_flag(int flag, bool t) {
        if (t) registers.F |= flag;
        else registers.F &= ~(flag);
    }

    // http://marc.rawer.de/Gameboy/Docs/GBCPUman.pdf
    void nop() {}

    void stop() {/* if (!interrupts.FJoypad) registers.PC--; */}
    // put value nn into addr
    void writeu16(u16 addr, u16 nn) {
        WB(addr, (u8)(nn & 0xFF));
        WB(addr, (u8)(nn >> 8));
    }

    void load16bit(u16 *addr, u16 nn) {*addr = nn;}

    template<typename T> // T is usually u8, with the exception of HL being u16 (see table r)
    void load8bit(T *addr, u8 n) {*addr = n;}

    // jump -127 -> +129 steps from the current address
    void jr(u8 d) {
